Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_10_Design verification  _10 KONSTRUKTSIOONIOMADUSTE KONTROLL.tmx
Source language: en
Languages: et

source: Design verification
et: KONSTRUKTSIOONIOMADUSTE KONTROLL

source: 10.1 General
et: 10.1 Üldnõuded

source: Under the responsibility of the original manufacturer, all design verifications shall be carried out or supervised by a competent person.
et: Esmatootja vastutusel peab kõiki konstruktsiooniomaduste kontrollitoiminguid sooritama või juhendama kompetentne isik.

source: Design verification is intended to verify compliance of the design of an assembly or assembly system with the requirements of the IEC 61439 series.
et: Konstruktsiooniomaduste kontroll on ette nähtud selleks, et veenduda kooste või koostesüsteemi ehituse vastavuses standardisarja IEC 61439 nõuetele.

source: Design verifications shall cover all declared mounting orientations.
et: Konstruktsiooniomaduste kontroll peab hõlmama kõiki deklareeritud monteerimissuunistusi.

source: Where tests on the assembly have been conducted in accordance with the IEC 60439 series (withdrawn) or previous editions of the IEC 61439 series, and the test results fulfil the requirements of the current edition of the relevant part of IEC 61439 series, the verification of these requirements need not be repeated.
et: Kui kooste katsetused on sooritatud vastavalt standardisarjale IEC 60439 (mis on tühistatud) või standardisarja IEC 61439 eelmistele väljaannetele ning kui katsetustulemused rahuldasid standardisarja IEC 61439 nüüdse väljaande asjakohase osa nõudeid, ei ole nende nõuete täitmise kontrolli vaja korrata.

source: Repetition of verifications in the product standards of switching devices or components including conductors incorporated in the assembly, which have been selected in accordance with 8.5.3 and installed in accordance with the instructions of their manufacturer is not required.
et: Koostesse paigaldatud lülitusaparaatide või komponentide, sealhulgas juhtide kontrolli kordamist tootestandardite järgi ei nõuta, kui aparaadid ja komponendid on valitud vastavalt jaotisele 8.5.3 ning paigaldatud vastavalt nende tootja juhistele.

source: Tests on individual devices and components including conductors to their respective product standards are not an alternative to the design verifications in this document for the assembly.
et: Üksikseadiste ja komponentide, sealhulgas juhtide katsetused vastavalt nende tootestandarditele ei asenda kooste konstruktsiooniomaduste kontrolli selle dokumendi järgi.

source: If modifications are made to a verified assembly, Clause 10 shall be used to check if these modifications affect the performance of the assembly.
et: Kui kontrollitavas koostes on tehtud muudatusi, tuleb nende muudatuste mõju kooste toimivusele kontrollida vastavalt peatükile 10.

source: New verifications shall be carried out if an adverse effect is likely.
et: Uusi kontrollitoiminguid tuleb sooritada juhul, mil muudatuste kahjulik mõju on tõenäoline.

source: The various methods include:
et: Kontrollimeetodite hulka kuuluvad

source: – verification testing;
et: — kontrollkatsetused;

source: – verification comparison with a reference design(s);
et: — kontrollvõrdlus etalonkonstruktsiooni(de)ga;

source: – verification assessment, i.e. confirmation of the correct application of calculations and design rules, including use of appropriate safety margins.
et: — kontrollhindamine, s.t arvutuste ja konstruktsioonireeglite korrektse rakendamise, sealhulgas asjakohaste ohutuspiiride kasutamise kinnitamine.

source: See Annex D for the full list of design verifications to be covered.
et: Konstruktsiooniomaduste arvestamist vajavate kontrollitoimingute täielik loetelu on esitatud lisas D.

source: When there is more than one method for the same verification, they are considered equivalent and the selection of the appropriate method is the responsibility of the original manufacturer.
et: Kui ühesama kontrollitoimingu jaoks on olemas enam kui üks meetod, loetakse neid meetodeid võrdväärseks ning asjakohase meetodi valik on esmatootja vastutusalas.

source: The tests shall be performed on a representative sample of an assembly in a clean and new condition.
et: Katsetused tuleb sooritada koostete esindusliku valimiga uues ja puhtas seisundis.

source: The performance of the assembly may be affected by the verification tests (e.g. short-circuit test).
et: Kontrollkatsetused (nt lühisekatsetus) võivad mõjutada kooste toimivust.

source: These tests should not be performed on an assembly that is intended to be placed in service.
et: Neid katsetusi ei tohi sooritada koostega, mis on ette nähtud talitlusse võtmiseks.

source: An assembly which is verified in accordance with this document by an original manufacturer (see 3.10.1) and manufactured or assembled by another does not require the original design verifications to be repeated if all the requirements and instructions specified and provided by the original manufacturer are met in full.
et: Kooste puhul, mida on kontrollinud kooskõlas selle dokumendiga esmatootja (vt termin 3.10.1) ja mille on tootnud või koostanud muu tootja, ei ole originaalsete konstruktsiooniomaduste kontrolli vaja korrata, kui kõik esmatootja sätestatud ja ettenähtud nõuded ja juhised on täielikult täidetud.

source: Where the assembly manufacturer incorporates their own arrangements not included in the original manufacturer’s verification, the assembly manufacturer is deemed to be the original manufacturer in respect of these arrangements and is responsible for verification of these alternate arrangements.
et: Kui kooste tootja on koostesse lisanud omalt poolt korraldusviise, mida esmatootja kontroll ei sisaldanud, tunnistatakse kooste tootjat nende korraldusviiside osas esmatootjaks ja vastutavaks nende alternatiivsete korraldusviiside eest.

source: Design verification shall comprise the following.
et: Konstruktsiooniomaduste kontroll peab sisaldama järgmisi kontrolliviise.

source: a) Construction:
et: a) Konstruktsioon:

source: 10.2 Strength of materials and parts;
et: 10.2 Materjalide ja osade tugevus.

source: 10.3 Degree of protection of assemblies (IP Code);
et: 10.3 Koostete kaitseaste (IP-kood).

source: 10.4 Clearances and creepage distances;
et: 10.4 Õhk- ja roomevahemikud.

source: 10.5 Protection against electric shock and integrity of protective circuits;
et: 10.5 Kaitse elektrilöögi eest ja kaitseahelate terviklikkus.

source: 10.6 Incorporation of switching devices and components;
et: 10.6 Lülitusaparaatide ja komponentide sissepaigutus.

source: 10.7 Internal electrical circuits and connections;
et: 10.7 Sisemised elektriahelad ja ühendused.

source: 10.8 Terminals for external conductors.
et: 10.8 Välisjuhtide klemmid.

source: b) Performance:
et: b) Toimivus:

source: 10.9 Dielectric properties;
et: 10.9 Dielektrilised omadused.

source: 10.10 Temperature-rise;
et: 10.10 Ületemperatuur.

source: 10.11 Short-circuit withstand strength;
et: 10.11 Lühisetaluvus.

source: 10.12 Electromagnetic compatibility.
et: 10.12 Elektromagnetiline ühilduvus.

source: The reference designs, the number of assemblies or parts thereof used for verification, the selection of the verification method when applicable, and the order in which the verification is carried out shall be at the discretion of the original manufacturer.
et: Etalonkonstruktsiooniviiside, kontrollimiseks kasutatavate koostete või nende osade arvu, kontrollimeetodi valiku, kui see on rakendatav, ning kontrolli sooritamise järjekorra peab määrama esmatootja.

source: The data used, calculations made, and comparisons undertaken for the verification of assemblies shall be recorded in verification reports.
et: Kasutatud andmed, tehtud arvutused ning koostete kontrollimiseks ette võetud võrdlused tuleb esitada kontrolliaruannetes.

source: 10.2 Strength of materials and parts 10.2.1 General The mechanical, electrical and thermal capability of constructional materials and parts of the assembly shall be deemed to be proven by verification of construction and performance characteristics.
et: 10.2 Materjalide ja osade tugevus 10.2.1 Üldnõuded Konstruktsioonimaterjalide ja kooste osade mehaanilise, elektrilise ja termilise vastupidavuse üle saab otsustada konstruktsiooni- ja toimivusomaduste kontrollimise teel.

source: Where an empty enclosure in accordance with IEC 62208:2011 is used, and it has not been modified so as to degrade the performance of the enclosure, no repetition of the enclosure testing to 10.2 is required.
et: Kui kasutatakse standardile IEC 62208:2011 vastavat tühja ümbrist ja kui selle ehitust pole muudetud selliselt, et selle omadused halveneksid, ei ole jaotisele 10.2 vastavaid ümbrise katsetusi vaja korrata.

source: 10.2.2 Resistance to corrosion 10.2.2.1 Verification by test The resistance to corrosion of representative samples of ferrous metallic enclosures, including internal and external ferrous metallic constructional parts of the assembly, shall be verified.
et: 10.2.2 Vastupidavus korrosioonile 10.2.2.1 Kontroll katsetamise teel Kooste raudmetallümbriste esindusliku valimi, sealhulgas kooste raudmetallist sisemiste ja väliste konstruktsiooniosade vastupidavust korrosioonile tuleb kontrollida.

source: The test shall be carried out on: – an enclosure or representative sample enclosure with representative internal parts in place and door(s) closed as in normal use, or – representative enclosure parts and internal parts separately.
et: Katsetus tuleb sooritada — ümbrisega või esindusliku näidisümbrisega koos paigal olevate esinduslike siseosadega ning suletud ukse või ustega nagu normaalkasutusel või — esinduslike ümbriseosade ja siseosadega eraldi.

source: In all cases, hinges, locks and fastenings shall also be tested unless they have previously been subjected to an equivalent test and their resistance to corrosion has not been compromised by their application.
et: Kõigil juhtudel tuleb katsetada ka hingesid, lukke ja kinnitusvahendeid, välja arvatud juhul, mil neid on varem samaväärselt katsetatud ning nende kasutamine pole seadnud korrosioonikindlust kahtluse alla.

source: Where the enclosure is subjected to the test, it shall be mounted as in normal use according to the original manufacturer's instructions.
et: Ümbris tuleb katsetamiseks paigaldada esmatootja juhiste kohaselt nagu normaalkasutusel.

source: The test specimens shall be new and in a clean condition and shall be subjected to severity test A or B, as detailed in 10.2.2.2 and 10.2.2.3.
et: Katsetusnäidised peavad olema uued ja puhtad ning nendega tuleb teha vastupidavuskatsetus A või B, nagu on üksikasjalikult kirjeldatud jaotistes 10.2.2.2 ja 10.2.2.3.

source: NOTE The salt mist test provides an atmosphere that accelerates corrosion and does not imply that the assembly is suitable for a salt-laden atmosphere.
et: MÄRKUS Soolaudukatsetusega tagatakse korrosiooni kiirendav keskkond, kuid sellest ei järeldu, et kooste on võimeline talitlema suure soolsusega keskkonnas.

source: 10.2.2.2 Severity test A This test is applicable to: – ferrous metallic indoor enclosures; – external ferrous metallic parts of indoor assemblies; – internal ferrous metallic parts of indoor and outdoor assemblies upon which intended mechanical operation may depend.
et: 10.2.2.2 Vastupidavuskatsetus A Seda katsetust saab rakendada — sisepaigaldiste raudmetallümbristele; — sisekoostete välistele raudmetallosadele; — sise- ja välispaigaldiste koostete sisemistele raudmetallosadele, millest võib sõltuda ettenähtud mehaaniline talitlus.

source: The test consists of: six cycles of 24 h each to damp heat cycling test according to IEC 60068-2-30:2005 (Test Db) at (40 ± 2) °C.
et: Katsetus koosneb tsüklilise märgkuumakatsetuse kuuest 24 tundi kestvast tsüklist vastavalt standardile IEC 60068-2-30:2005 (katsetus Db) temperatuuril (40 ± 3) °C,

source: Variant 1 or 2 to be selected as recommended by Annex A of IEC 60068-2- 30:2005,
et: mis tuleb valida standardi IEC 60068-2-30:2005 lisa A soovituse kohaselt,

source: followed by,
et: ja seejärel

source: two cycles of 24 h each to salt mist test according to IEC 60068-2-11:1981
et: soolaudukatsetuse kahest 24 tundi kestvast tsüklist vastavalt standardile IEC 60068-2-11:1981

source: (Test Ka: Salt mist) at a temperature of (35 ± 2) °C.
et: (katsetus Ka: soolaudu) temperatuuril (35 ± 2) °C.

source: 10.2.2.3 Severity test B
et: 10.2.2.3 Vastupidavuskatsetus B

source: This test is applicable to:
et: Seda katsetust saab rakendada

source: – ferrous metallic outdoor enclosures;
et: — välispaigaldiste raudmetallümbristele,

source: – external ferrous metallic parts of outdoor assemblies.
et: — väliskoostete välistele raudmetallosadele.

source: The test comprises two identical 12-day periods.
et: Katsetus koosneb kahest ühesugusest 12 päeva vältavast ajavahemikust.

source: Each 12-day period comprises: five cycles of 24 h each to damp heat cycling test according to IEC 60068-2-30:2005 (Test Db) at (40  2) °C.
et: Kummagi 12-päevase vahemiku kestel sooritatakse tsüklilise märgkuumakatsetuse viiest 24 tundi kestvast tsüklist vastavalt standardile IEC 60068-2-30:2005 (katsetus Db) temperatuuril (40 ± 2) °C.

source: followed by:
et: Seejärel toimub

source: seven cycles of 24 h each to salt mist test according to IEC 60068-2-11:1981 (Test Ka: Salt mist) at a temperature of (35  2) °C.
et: soolaudukatsetuse seitsmest 24 tundi kestvast tsüklist vastavalt standardile IEC 60068-2-11:1981 (katsetus Ka: soolaudu), temperatuuril (35 ± 2) °C.

source: 10.2.2.4 Results to be obtained After the test, the enclosure or samples shall be washed in running tap water for 5 min, rinsed in distilled or demineralized water, then shaken or subjected to an air blast to remove water droplets.
et: 10.2.2.4 Saavutamist vajavad tulemused Pärast katsetust tuleb ümbris või näidised 5 minuti kestel voolavas survevees puhtaks pesta, destilleeritud või demineraliseeritud veega loputada ning seejärel veetilgad maha raputada või õhujoaga ära puhuda.

source: The specimen under test shall then be stored under normal service conditions for 2 h.
et: Katsetusnäidist tuleb seejärel hoida 2 tundi normaaltalitlusoludes.

source: Compliance is checked by visual inspection to determine that: – there is no evidence of cracking or other deterioration other than iron oxide as allowed by ISO 4628-3:2016 for a degree of rusting Ri1 (considering the sample as a whole).
et: Nõuetele vastavust kontrollitakse visuaalse ülevaatusega veendumaks, et — ei ole näha pragunemist ega muid kahjustusi, väljaarvatult raudoksiidi, nagu see on lubatud standardiga ISO 4628-3:2016 roosteaste Ri1 puhul (arvestades näidist tervikuna).

source: However, surface deterioration of the protective coating is allowed.
et: Lubatakse aga pinnakaitsekatete kulumist.

source: In case of doubt associated with paints and varnishes, reference shall be made to ISO 4628-3:2016 to verify that the samples conform to the specimen Ri1; – the mechanical integrity is not impaired; – seals are not damaged; – doors, hinges, locks, and fastenings work without abnormal effort.
et: Kahtluse korral seoses värvide ja lakkidega tuleb toetuda standardile ISO 4628-3:2016, et kontrollida, kas valimid vastavad näidisele Ri1; — mehaaniline terviklikkus ei ole kahjustatud; — tihendid ei ole kahjustatud; — uksed, hinged, lukud ja kinnitusvahendid toimivad ülemäärase jõu rakendamiseta.

source: 10.2.2.5 Verification by comparison to reference design Similar enclosures, enclosure parts and internal ferrous metallic parts, irrespective of their shape and size, are covered by the corrosion test on the representative samples if they are manufactured from the same materials and with the same surface treatments, using the same manufacturing process.
et: 10.2.2.5 Kontroll võrdlemise teel etalonkonstruktsiooniga Ühesugused ümbrised, ümbriseosad ja sisemised raudmetallosad, sõltumata nende kujust ja suurusest, on hõlmatud esinduslike näidiste korrosioonikatsetusega, kui need on valmistatud ühesugustest materjalidest ja ühesuguste pinnakäsitlusviisidega, kasutades ühesugust tootmisprotsessi.

source: 10.2.3 Properties of insulating materials 10.2.3.1 Thermal stability 10.2.3.1.1 Verification of thermal stability of enclosures by test The thermal stability of enclosures manufactured from insulating material shall be verified by the dry heat test.
et: 10.2.3 Isoleermaterjalide omadused 10.2.3.1 Soojuslik stabiilsus 10.2.3.1.1 Ümbriste soojusliku stabiilsuse kontroll katsetuse teel Isoleermaterjalist ümbriste soojuslikku stabiilsust tuleb kontrollida kuivkuumakatsetusega.

source: The test shall be carried out according to IEC 60068-2-2:2007 (Test Bb), at a temperature of 70 °C, with natural air circulation, for a duration of 168 h and with a recovery of 96 h.
et: Katsetus tuleb sooritada standardi IEC 60068-2-2:2007 (katsetus Bb) kohaselt temperatuuril 70 °C loomuliku õhuringluse juures kestusega 168 tundi ning taastumisajaga 96 tundi.

source: Parts intended for decorative purposes that have no technical significance shall not be considered for the purpose of this test.
et: Dekoratiivseks otstarbeks ette nähtud osi, millel ei ole tehnilist tähtsust, ei tule arvestada selle katsetuse vajadusena.

source: The enclosure, mounted as in normal use, is subjected to a test in a heating cabinet with an atmosphere having the composition and pressure of the ambient air and ventilated by natural circulation.
et: Normaalkasutuseks mõeldud viisil paigaldatud ümbrist katsetatakse soojenduskapis, mille atmosfääri koostis ja rõhk vastavad ümbritsevale õhule ning kappi ventileeritakse loomuliku õhuringlusega.

source: If the dimensions of the enclosure are too large for the available heating cabinet, the test may be carried out on a representative sample of the enclosure.
et: Kui ümbrise mõõtmed on liiga suured võrreldes kasutatava soojenduskapi mõõtmetega, võib katsetuse sooritada ümbrise esindusliku näidisega.

source: The use of an electrically heated cabinet is recommended.
et: Soovitatakse kasutada elektriliselt soojendatavat kappi.

source: Natural circulation may be provided by holes in the walls of the cabinet.
et: Loomuliku õhuringluse saab tagada kapi seintes olevate avadega.

source: The enclosure or sample shall show no crack visible to normal or corrected vision without additional magnification nor shall the material have become sticky or greasy, this being judged as follows: – With the forefinger wrapped in a dry piece of rough cloth, the sample is pressed with a force of 5 N. NOTE The force of 5 N can be obtained in the following way: the enclosure or sample is placed on one of the pans of a balance and the other pan is loaded with a mass equal to the mass of the sample plus 500 g.
et: Ümbrisel või näidisel ei tohi olla normaalse või korrigeeritud nägemise korral suurenduseta nähtavaid mõrasid ja materjal ei tohi muutuda kleepuvaks ega rasvaseks, mida otsustatakse järgmiselt: — kuiva karedasse riidetükki mähitud nimetissõrmega survestatakse näidist jõuga 5 N. MÄRKUS Jõudu 5 N saab tekitada järgmiselt: ümbris või näidis asetatakse ühele kaalukausile ja näidisega võrdne mass koos lisamassiga 500 g teisele kaalukausile.

source: Equilibrium is then restored by pressing the sample with the forefinger wrapped in a dry piece of rough cloth.
et: Tasakaalu taastamiseks surutakse näidisele kuiva karedasse riidetükki mähitud nimetissõrmega.

source: No traces of the cloth shall remain on the sample, and the material of the enclosure or the sample shall not stick to the cloth.
et: Näidisele ei tohi jääda riidematerjali jälgi ja ümbrise või näidise materjal ei tohi kleepuda riide külge.

source: 10.2.3.1.2 Verification of thermal stability of enclosures by comparison Enclosures or parts attached to the enclosure of same materials, same colour, same or greater thickness of the walls and same general construction, but with, for example, other dimensions, are covered by the test on the representative samples.
et: 10.2.3.1.2 Ümbriste soojusliku stabiilsuse kontroll võrdlemise teel Ümbrised või ümbristele kinnitatud samast materjalist, sama värvi, sama või suurema seinapaksusega ja sama üldkonstruktsiooniga osad, kuid näiteks teistsuguste mõõtmetega, on kaetud esinduslike näidiste katsetamisega.

source: 10.2.3.2 Verification of resistance of insulating materials to abnormal heat and fire due to internal electric effects 10.2.3.2.1 Verification by test The glow-wire test principles of IEC 60695-2-10:2013 and the details given in IEC 60695-211:2014 shall be used to verify the suitability of the materials used: a) on parts of assemblies, or b) on specimens taken from these parts.
et: 10.2.3.2 Isoleermaterjalide sisemistest elektrilistest toimetest tingitud anomaalse kuumuse ja tule taluvuse kontroll 10.2.3.2.1 Kontroll katsetamise teel Hõõgtraatkatsetust, mille põhimõtted on esitatud standardis IEC 60695-2-10:2013 ja üksikasjad standardis IEC 60695-2-11:2014, tuleb kasutada materjalide sobivuse kontrolliks, mis on võetud a) koostete osadest või b) nendest osadest võetud näidistest.

source: The test shall be carried out on material with the minimum thickness used for the parts in a) or b).
et: Katsetus tuleb sooritada vähima paksusega materjaliga, mida kasutatakse punktis a või b esitatud osade puhul.

source: For a description of the test, see Clause 8 of IEC 60695-2-11:2014.
et: Katsetus on kirjeldatud standardi IEC 60695-2-11:2014 peatükis 8.

source: The apparatus to be used shall be as described in Clause 5 of IEC 60695-2-11:2014.
et: Kasutatav aparatuur peab vastama standardi IEC 60695-2-11:2014 peatükis 5 esitatud kirjeldusele.

source: The temperature of the tip of the glow-wire shall be as follows: – 960 °C for parts necessary to retain current-carrying parts in position; – 850 °C for enclosures to be installed in hollow walls; – 650 °C for all other parts, including parts necessary to retain the protective conductor and enclosure parts intended to be embedded in and mounted on walls which are combustionresistant.
et: Hõõgtraadi otsaku temperatuur peab olema järgmine: — 960 °C osade puhul, mis on ette nähtud voolujuhtivate osade kohalhoidmiseks; — 850 °C ümbriste puhul, mis on ette nähtud paigaldamiseks õõnesseintesse; — 650 °C kõigi muude osade puhul, sealhulgas osade puhul, mis on vajalikud kaitsejuhi hoidmiseks, ja ümbrise osade puhul, mis on ette nähtud paigaldamiseks süttimiskindlatesse seintesse või selliste seinte pinnale.

source: NOTE 1 Tolerances for temperatures of the tip are included in IEC 60695-2-11:2014.
et: MÄRKUS 1 Otsaku temperatuuri tolerantsid on võetud standardisse IEC 60695-2-11:2014.

source: NOTE 2 Parts of the assembly made from insulating material are considered to be end products and are to be tested in accordance with IEC 60695-2-11:2014.
et: MÄRKUS 2 Kooste isoleermaterjalist osad arvestatakse lõpptoodetena ja neid tuleb katsetada standardi IEC 60695-2-11:2014 kohaselt.

source: For small parts having surface dimensions not exceeding 14 mm × 14 mm, an alternative test may be used (e.g. needle flame test, according to IEC 60695-11-5:2016).
et: Väikeste osade kohta, mille pinna mõõtmed ei ole üle 14 mm × 14 mm, võib kasutada alternatiivset katsetust (nt nõelleegikatsetust vastavalt standardile IEC 60695-11-5:2016).

source: The same procedure may be applicable for other practical reasons where the metal material of a part is large compared to the insulating material.
et: Sama protseduur võib olla rakendatav muudel praktilistel põhjustel, mil osa metallmaterjal on tugevasti võrreldav isoleermaterjaliga.
